project/app/controllers/v1/categories_controller.rb

SELECT "categories".* FROM "categories"  WHERE "categories"."user_id" IN ('---
---
  def index
    respond_with Category.where(user_id: current_user['_id']).all