project/app/controllers/v1/expenses_controller.rb

INSERT INTO "categories" ("color", "created_at", "label", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["color", "ae1268"], ["created_at", "2014-05-11 17:22:19.778110"], ["label", "Nova Categoria"], ["updated_at", "2014-05-11 17:22:19.778110"], ["user_id", 536]]
INSERT INTO "expenses" ("created_at", "date", "subcategory_id", "updated_at", "value") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-05-04 23:10:59.095437"], ["date", "2014-05-04"], ["subcategory_id", 1], ["updated_at", "2014-05-04 23:10:59.095437"], ["value", 10000]]
INSERT INTO "subcategories" ("category_id", "color", "created_at", "label", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["color", "eddd92"], ["created_at", "2014-05-04 23:39:48.794863"], ["label", "Subcategory"], ["updated_at", "2014-05-04 23:39:48.794863"]]
---
  def create
    params[:user_id] = user_id

    expense = Expense.initialize_with_params(params.permit(:value, :date, :category, :subcategory, :user_id))
    expense.save!